[
  {
    "patchCount": 0,
    "version": "v0.3.0",
    "date": "June 11th, 2019",
    "body": "<p>Welcome to the second biggest patch of the Forge & Fortune Lifecycle!</p><p><b>Combat</b></p><ul><li>Heroes now have a combat skill, triggered by reaching Max AP. Description of abilities are available on the hero screen. Heroes skill strength is largely determined by total POW.</li><li>Combat system has been updated from time-based to round-based.</li><li>ACT has been replaced by AP Add. Weapon POW is no longer normalized (AKA, the damage you see listed is the damage you deal). AP Add serves a similar purpose to ACT -- the more damage your weapon deals, the less AP it will generate (and thus the less skills your hero will use).</li><li>There are now three dungeons, each containing unique materials. Dungeon floors are random but pre-determined. Dungeons (and bosses) may lock out certain heroes, making them unable to adventure in that dungeon.</li><li>Floors reachable are capped at 50 floors per boss kill. For example, to reach floor 51-100 you'd need to beat the first boss. Bosses are unlockable in the Action League and challenged in the adventure screen.</li><li>Every 50th floor (up until Floor 450) can be converted to a Sanctuary which will heal your heroes upon reaching it. This is purchasable as a Perk in the Action League.</li></ul><p><b>Guilds</b></p><ul><li>The worker item contribution system has been replaced by a crafting guild system. There are five craft guilds, each with two major resources each. (Worker screen and worker auto-contribute were also removed as a consequence).</li><li>Complete guild orders to increase your guild level, unlocking new recipes!</li><li>Workers associated with the guild can be leveled up in the guild for gold once unlocked.</li></ul><p><b>Action League</b></p><ul><li>Tired of just seeing the Action League send you your materials? This is for you!</li><li>Hero experience (and levels) have been removed. Instead, completing dungeons awards you with Notoriety.</li><li>Once the required notoriety thresholds have been reached, Perks will be available for purchase for gold.</li><li>Perks are a permanent content unlock, such as new heroes, new workers, and permanent bonuses. It's also how new bosses become available.</li><li>Notoriety is capped based off bosses slayed. Kill more bosses to increase your notoriety caps!</li></ul><p><b>Town</b></p><ul><li>Town construction has been replaced by a single recipe to be slotted in an action slot (no more nails taking up inventory!)</li></ul><p><b>Recipes</b></p><ul><li>Filters are now more prominent at the top of the recipe screen.</li><li>Recipes are now searchable. Want to know how many recipes contain 'aker' in them? Now it's easy! (Hint: it's three)</li></ul><p><b>User Interface</b></p><ul><li>Improvements to almost every facet of the interface have been implemented.</li><li>Recipes are now shown in card form (to better scale with resolution and provide the content room for future features).</li><li>New icons are next to most headers to improve sexiness</li><li>Animations added to make it as smooth as butter</li><li>Left interface sidebar has been removed to facilitate smaller resolutions (in anticipation of Kongregate port). All information has been moved to the right bar with the exception of workers/materials information -- this is now listed on the recipe screen directly at the very top.</li><li>Footer bar is 1.2x more clickable, Patch notes are now listed in game, and as new patches come out the game should notify you of it (no more checking discord all the time!)</li></ul><p><b>Settings</b></p><ul><li>Battle Log Length: New setting that allows you to set the length of your battle log from 5 entries, up to 999 entries.</li><li>Toggle HP & AP Bars in Combat Area: Want some extra content space, hide the redundant HP and AP bars in the combat area with this setting.</li></ul><p>As always, thank you from the bottom of our hearts for playing our love child and we hope to see you for many patches to come! Make sure to stop by our discord and give us feedback on anything and everything you love or hate.</p><p>- Akerson & Friends</p><p class='hamster'>May the Lettuce be with you!</p>"
  },
  {
    "patchCount": 1,
    "version": "v0.3.0.1",
    "date": "June 11th, 2019",
    "body": "<ul><li>Fixed gold display on load (never was missing, just not updated properly)</li><li>Fixed workers not showing up in guilds after being bought in Action League</li></ul>"
  },
  {
    "patchCount": 2,
    "version": "v0.3.0.2",
    "date": "June 11th, 2019",
    "body": "<ul><li>Fixed Abqu Love Letter of notoriety cap not displaying</li><li>Fixed Flood (& subsequent mobs in the line) to drop correct resource</li><li>Removed flat function for browser compatibility</li><li>New patch notifications should work now</li></ul>"
  },
  {
    "patchCount": 4,
    "version": "v0.3.0.3",
    "date": "June 11th, 2019",
    "body": "<p>Is four patches in one day too much? We think not!</p><ul><li>Lowered armor on Boss 1 and Boss 2 to make it less impossible</li><li>Updated the notoriety cap love letter to be less unclear</li><li>Removed worker levels -- who needs 'em anyway?</li></ul>"
  }
]